Repository: NEOSidekick/NEOSidekick.Revisions
Catalog: Resources/Private/Translations/*/Main.xlf
Languages: de

# header.label
source: Label
de: Bezeichnung

# header.actions
source: Actions
de: Aktionen

# header.identifier
source: Identifier
de: Kennung

# list.noRevisionsFound
source: No revisions found
de: Keine Revisionen gefunden

# revision.label
source: By {creator}
de: Von {creator}

# tooltip.revisionLabel
source: Created on {revisionDate} by {creator}
de: Erstellt am {revisionDate} von {creator}

# action.close
source: Close
de: Schließen

# action.apply
source: Apply
de: Anwenden

# action.apply.newRevisionLabel
source: Applied revision {revision}
de: Angewandte Revision {revision}

# action.apply.title
source: Apply revision {revisionDate} by {creator}
de: Revision {revisionDate} von {creator} anwenden

# action.edit.title
source: Edit revision {revisionDate} by {creator}
de: Revision {revisionDate} von {creator} bearbeiten

# action.delete.title
source: Delete revision {revisionDate} by {creator}
de: Revision {revisionDate} von {creator} löschen

# success.revisionApplied
source: Revision applied
de: Revision angewandt

# success.revisionApplied.message
source: Revision "{label}" by "{creator}" applied.
de: Revision "{label}" von "{creator}" angewendet.

# success.revisionDeleted
source: Revision deleted
de: Revision gelöscht

# success.revisionDeleted.message
source: Revision "{label}" by "{creator} deleted.
de: Revision "{label}" von "{creator} gelöscht.

# success.revisionUpdated
source: Revision updated
de: Revision aktualisiert

# success.revisionUpdated.message
source: Revision {label} by "{creator}" updated.
de: Revision {label} von "{creator}" aktualisiert.

# error.failedFetchingRevisions
source: An error occurred while fetching revisions.
de: Beim Abrufen von Revisionen ist ein Fehler aufgetreten.

# error.failedApplyingRevision
source: An error occurred while applying revision.
de: Bei der Anwendung der Revision ist ein Fehler aufgetreten.

# error.failedUpdatingRevision
source: An error occurred while updating revision.
de: Beim Aktualisieren der Revision ist ein Fehler aufgetreten.

# error.failedDeletingRevision
source: An error occurred while deleting a revision.
de: Beim Löschen einer Revision ist ein Fehler aufgetreten.

# error.verifyResolveConflicts
source: Some conflicts were detected. Do you still want to apply the revision?{conflicts}
de: Es wurden einige Konflikte festgestellt. Möchten Sie die Revision trotzdem anwenden?{conflicts}

# error.revisionNotFound
source: Revision not found
de: Revision nicht gefunden

# error.revisionHasConflicts
source: Revision has conflicts
de: Revision hat Konflikte

# error.nodeNotFound
source: Page not found
de: Seite nicht gefunden

# error.revisionNotApplied
source: Failed to apply revision
de: Revision konnte nicht angewandt werden

# confirm.applyRevision
source: Do you want to apply revision {revisionDate} by {creator}?
de: Möchten Sie Revision {revisionDate} von {creator} anwenden?

# diff.header
source: Version "{version}" (created on {date}) contains the following changes:
de: Version "{version}" (erstellt am {date}) enthält die folgenden Änderungen:

# diff.propertyLabel
source: Modification of the "{propertyLabel}" property
de: Änderung der Eigenschaft "{propertyLabel}"

# diff.removeNode
source: Remove
de: Entferne

# diff.addNode
source: Add
de: Füge hinzu

# diff.changeNode
source: Update
de: Aktualisiere

# diff.old
source: Old
de: Alt

# diff.new
source: New
de: Neu
